/*
Copyright (C) 2013 Daniel Dyer

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in
all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

#include <stdlib.h>
#include <string.h>
#include <stdint.h>
#include <assert.h>
#include <stdbool.h>

#ifndef __TI_COMPILER_VERSION__
    #include "config.h"
    #include "../c/cnmpc.h"
#else
    #define USE_DSP_INTRINSICS

    #include "config.h"
    #include "cnmpc.h"
#endif

#include "c66math.h"
#include "qpDUNES/qpDUNES.h"

/*
Use static allocation for qpDUNES structures, since the sizes are all known at
compile time -- see qpDUNES/setup_qp.c:40-267
*/
#define nX NMPC_DELTA_DIM
#define nU NMPC_CONTROL_DIM
#define nI OCP_HORIZON_LENGTH
#define nZ (nX + nU)
#define nV nZ

struct static_interval_t { /* 1584B + sizeof(interval) */
    interval_t interval;

    /*
    Statically-allocated storage for the interval matrices. Since nD is zero,
    some of these are set to 1 to avoid non-standard zero-length arrays.

    H_data and cholH_data are meant to be nV * nV, but since they'll both
    always be diagonal we can just use one row.
    */
    real_t H_data[nV]; /* 60B */
    real_t cholH_data[nV]; /* 60B */
    real_t q_data[nV]; /* 60B */
    real_t C_data[nX * nV]; /* 720B */
    real_t c_data[nX]; /* 48B */
    real_t zLow_data[nV]; /* 60B */
    real_t zUpp_data[nV]; /* 60B */
    real_t z_data[nV]; /* 60B */
    real_t y_data[2u * nV]; /* 120B */
    real_t lambdaK_data[nX]; /* 48B */
    real_t lambdaK1_data[nX]; /* 48B */
    real_t clippingSolver_qStep_data[nV]; /* 60B */
    real_t clippingSolver_zUnconstrained_data[nV]; /* 60B */
    real_t clippingSolver_dz_data[nV]; /* 60B */

    /*
    These are allocated in qpDUNES_setup rather than qpDUNES_allocInterval,
    but they're still per-interval.
    */
    real_t zVecTmp_data[nZ]; /* 60B */
};

struct static_qpdata_t {
    qpData_t qpdata;

    /* QP solver data */
    interval_t *intervals_data[nI + 1u]; /* 404B */
    struct static_interval_t interval_recs[nI + 1u]; /* 287244B + 101*sizeof(interval) */
    real_t lambda_data[nX * nI]; /* 4800B */
    real_t deltaLambda_data[nX * nI]; /* 4800B */
    real_t hessian_data[nX * 2u * nX * nI]; /* 115200B */
    real_t cholHessian_data[nX * 2u * nX * nI]; /* 115200B */
    real_t gradient_data[nX * nI]; /* 4800B */
    real_t xVecTmp_data[nX]; /* 48B */
    real_t xxMatTmp_data[nX * nX]; /* 576B */
    real_t zxMatTmp_data[nZ * nX]; /* 720B */

    /* Logging data */
    itLog_t itLog_data;
    int_t *ieqStatus_data[nI + 1u]; /* 404B */
    int_t *prevIeqStatus_data[nI + 1u]; /* 404B */
    int_t ieqStatus_n_data[(nI + 1u) * nZ]; /* 6060B */
    int_t prevIeqStatus_n_data[(nI + 1u) * nZ]; /* 6060B */
};

#undef nX
#undef nU
#undef nD
#undef nI
#undef nZ
#undef nV

/* Math routines */
#define X 0
#define Y 1
#define Z 2
#define W 3

#ifndef absval
#define absval(x) ((x) < 0 ? -x : x)
#endif

#ifndef max
#define max(a,b) (((a) > (b)) ? (a) : (b))
#endif

#ifndef M_PI
#define M_PI ((real_t)3.14159265358979323846)
#define M_PI_2 (M_PI * 0.5)
#define M_PI_4 (M_PI * 0.25)
#endif

#if defined(NMPC_SINGLE_PRECISION)
#define NMPC_EPS_4RT ((real_t)1.857e-2)
#elif defined(NMPC_DOUBLE_PRECISION)
#define NMPC_EPS_4RT ((real_t)1.221e-4)
#endif

#define NMPC_INFTY ((real_t)1.0e12)

#define G_ACCEL ((real_t)9.80665)
#define RHO ((real_t)1.225)


/* Math routines -- assume float */
static inline void quaternion_multiply(real_t *restrict res,
const real_t q1[4], const real_t q2[4]) {
